app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    latest_message_info = params[:id] unless params[:id].nil?
    respond_to do |format|
      format.html
      format.json{ @new_messages = @messages.where('id > ?', latest_message_info) }
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 3
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @message = @group.messages.new(message_params)
    if @message.save
      respond_to do |format|
       format.html {redirect_to group_messages_path(@group), notice: 'メッセージが送信されました'}
       format.json
      end
    else
      respond_to do |format|
          @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `user_id`, `group_id`, `created_at`, `updated_at`) VALUES ('sss', 1, 1, '2019-03-21 06:42:29', '2019-03-21 06:42:29')
SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1